coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/source/tmpm369_rtc.c
    /* Set PAGER<ENAALM> to enable alarm function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENAALM_CLEAR;
    tmp |= PAGER_ENAALM_SET;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Disable RTC alarm function.
  * @param  None
  * @retval None
  */
void RTC_DisableAlarm(void)
{
    uint8_t tmp = 0U;

    /* Clear PAGER<ENAALM> to disable alarm function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENAALM_CLEAR;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Enable or disable INTRTC.
  * @param  NewState: New state of RTCINT.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void RTC_SetRTCINT(FunctionalState NewState)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Set PAGER<INTENA> to enable or disable INTRTC */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_INTENA_CLEAR;

    if (NewState == ENABLE) {
        tmp |= PAGER_INTENA_SET;
    } else {
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Set output signals from ALARM pin.
  * @param  Output: Set ALARM pin output.
  *   This parameter can be RTC_LOW_LEVEL, RTC_PULSE_1_HZ
  *   or RTC_PULSE_16_HZ,RTC_PULSE_2_HZ,RTC_PULSE_4_HZ,RTC_PULSE_8_HZ.
  * @retval None
  */
void RTC_SetAlarmOutput(uint8_t Output)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_ALARM_OUTPUT(Output));

    switch (Output) {
    case RTC_LOW_LEVEL:
        /* Set PAGER<ENAALM> = 1 to enable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        tmp |= PAGER_ENAALM_SET;
        TSB_RTC->PAGER = tmp;
        /* Set All DIS bits = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= RESTR_DIS_SET;
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_1_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS1HZ> = 0 and others DIS bit = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_16_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS16HZ> = 0 and others DIS bit = 1 */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS1HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_2_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS2HZ> = 0 and others DIS bit = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS1HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_4_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS4HZ> = 0 and others DIS bit = 1 */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS1HZ_SET | RESTR_DIS8HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    case RTC_PULSE_8_HZ:
        /* Set PAGER<ENAALM> = 0 to disable alarm function */
        tmp = TSB_RTC->PAGER;
        tmp &= PAGER_ENAALM_CLEAR;
        TSB_RTC->PAGER = tmp;
        /* Set RESTR<DIS8HZ> = 0 and others DIS bit = 1  */
        tmp = TSB_RTC->RESTR;
        tmp &= RESTR_DIS_CLEAR;
        tmp |= (uint8_t) (RESTR_DIS16HZ_SET | RESTR_DIS2HZ_SET);
        tmp |= (uint8_t) (RESTR_DIS4HZ_SET | RESTR_DIS1HZ_SET);
        TSB_RTC->RESTR = tmp;
        break;
    default:
        /* do nothing */
        break;
    }
}

/**
  * @brief  Reset RTC clock second counter.
  * @param  None
  * @retval None
  */
void RTC_ResetClockSec(void)
{
    uint8_t tmp = 0U;

    /* Set RESTR<RSTTMR> = 1 to reset clock sec counter */
    tmp = TSB_RTC->RESTR;
    tmp &= RESTR_RSTTMR_CLEAR;
    tmp |= RESTR_RSTTMR_SET;
    TSB_RTC->RESTR = tmp;
}

/**
  * @brief  Get request state for reset RTC clock second counter.
  * @param  None
  * @retval The state of reset clock request.
  * This parameter can be one of the following values:
  * RTC_REQ or RTC_NO_REQ
  */
RTC_ReqState RTC_GetResetClockSecReq(void)
{
    uint8_t tmp0 = 0U;
    RTC_ReqState tmp1 = RTC_NO_REQ;

    tmp0 = TSB_RTC->RESTR;
    tmp0 &= RESTR_RSTTMR_SET;

    if (tmp0 == RESTR_RSTTMR_SET) {
        tmp1 = RTC_REQ;
    } else {
        tmp1 = RTC_NO_REQ;
    }

    return (tmp1);
}

/**
  * @brief  Set the RTC date.
  * @param  DateStruct: The structure containing basic Date configuration.
  * @retval None
  */
void RTC_SetDateValue(RTC_DateTypeDef * DateStruct)
{
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(DateStruct));
    assert_param(IS_RTC_LEAP_YEAR(DateStruct->LeapYear));
    assert_param(IS_RTC_YEAR(DateStruct->Year));
    assert_param(IS_RTC_MONTH(DateStruct->Month));
    assert_param(IS_RTC_DATE(DateStruct->Date));
    assert_param(IS_RTC_DAY(DateStruct->Day));

    /* Set LeapYear */
    RTC_SetLeapYear(DateStruct->LeapYear);
    /* Set year value */
    RTC_SetYear(DateStruct->Year);
    /* Set month value */
    RTC_SetMonth(DateStruct->Month);
    /* Set date value */
    RTC_SetDate(RTC_CLOCK_MODE, DateStruct->Date);
    /* Set day value */
    RTC_SetDay(RTC_CLOCK_MODE, DateStruct->Day);
}

/**
  * @brief  Get the RTC date.
  * @param  DateStruct: The structure containing basic Date configuration will be modified.
  * @retval None
  */
void RTC_GetDateValue(RTC_DateTypeDef * DateStruct)
{
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(DateStruct));

    /* Get LeapYear */
    DateStruct->LeapYear = RTC_GetLeapYear();
    /* Get year value */
    DateStruct->Year = RTC_GetYear();
    /* Get month value */
    DateStruct->Month = RTC_GetMonth();
    /* Get date value */
    DateStruct->Date = RTC_GetDate(RTC_CLOCK_MODE);
    /* Get day value */
    DateStruct->Day = RTC_GetDay(RTC_CLOCK_MODE);
}

/**
  * @brief  Set the RTC time.
  * @param  TimeStruct: The structure containing basic Time configuration.
  * @retval None
  */
void RTC_SetTimeValue(RTC_TimeTypeDef * TimeStruct)
{
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(TimeStruct));
    assert_param(IS_RTC_HOUR_MODE(TimeStruct->HourMode));

    if (TimeStruct->HourMode) {
        assert_param(IS_RTC_HOUR_24(TimeStruct->Hour));
    } else {
        assert_param(IS_RTC_HOUR_12(TimeStruct->Hour));
        assert_param(IS_RTC_AMPM_MODE(TimeStruct->AmPm));
    }

    assert_param(IS_RTC_MINUTE(TimeStruct->Min));
    assert_param(IS_RTC_SECOND(TimeStruct->Sec));

    /* Set hour mode */
    RTC_SetHourMode(TimeStruct->HourMode);

    /* Set hour value */
    if (TimeStruct->HourMode == RTC_24_HOUR_MODE) {
        RTC_SetHour24(RTC_CLOCK_MODE, TimeStruct->Hour);
    } else {
        RTC_SetHour12(RTC_CLOCK_MODE, TimeStruct->Hour, TimeStruct->AmPm);
    }

